In [1]:
x=10

In [2]:
print(x)

10

In [12]:
import pandas as pd

In [14]:
data1 = pd.read_excel(r'C:\Users\admin\Desktop\my data 1.xlsx')

In [15]:
data1

   Name   Age  salary
0  Pinky   30   20000
1   John   22   15000
2   Neha   25   30000
3    Raj   26   35000

In [17]:
data2 = pd.read_csv(r'C:\Users\admin\Desktop\my dat 2 csv.csv')

In [18]:
data2

   Roll no    Name    Batch
0      1001   Pinky    1840
1      1002     John   1843
2      1003   Deepak   1840
3      1004  Anjuman   1765